# Pandas - Merge Dataframes
<a href="https://app.naas.ai/user-redirect/naas/downloader?url=https://raw.githubusercontent.com/jupyter-naas/awesome-notebooks/master/Python%20Snippets/Pandas/Merging%20Datasets.ipynb" target="_parent"><img src="https://img.shields.io/badge/-Open%20in%20Naas-success?labelColor=000000&logo="/></a>

## Input

### Import Library

In [19]:
import pandas as pd
import numpy as np

### Create dataframes to be merged

#### Dataframe 1

In [20]:
# Creating values to be used as datasets
dict1 = {
    "student_id": [1,2,3,4,5,6,7,8,9,10],
    "student_name": ["Peter","Dolly","Maggie","David","Isabelle","Harry","Akin","Abbey","Victoria","Sam"],
    "student_course": np.random.choice(["Biology","Physics","Chemistry"], size=10)
}

In [21]:
# Create dataframe
df_1 = pd.DataFrame(dict1)
df_1

   student_id student_name student_course
0           1        Peter        Biology
1           2        Dolly        Physics
2           3       Maggie        Physics
3           4        David        Physics
4           5     Isabelle        Physics
5           6        Harry        Physics
6           7         Akin      Chemistry
7           8        Abbey        Physics
8           9     Victoria        Biology
9          10          Sam        Biology

#### Dataframe 2

In [22]:
# Creating values to be used as datasets
dict2 = {
    "student_id": np.random.choice([1,2,3,4,5,6,7,8,9,10], size=100),
    "student_grade": np.random.choice(["A","B","C","D","E","F"], size=100),
    "professors": np.random.choice(["Mark Levinson","Angela Marge","Bonnie James","Klaus Michealson"], size=100),
}

In [23]:
# Create dataframe
df_2 = pd.DataFrame(dict2)  # OR Data2=pd.read_csv(filepath)
df_2

    student_id student_grade        professors
0            6             E  Klaus Michealson
1            8             C     Mark Levinson
2            3             F  Klaus Michealson
3            6             E     Mark Levinson
4            4             C      Bonnie James
..         ...           ...               ...
95          10             D     Mark Levinson
96          10             C      Bonnie James
97           8             C      Angela Marge
98           7             C  Klaus Michealson
99           9             F      Angela Marge

[100 rows x 3 columns]

## Model
pd.merge: acts like an SQL inner join and joins based on similar columns or index unless specified to join differently<br />

### Merging dataframes with same values with same column names
Using pd.merge(left, right) acts like sql inner join and only joins on the common column they have.<br>
It tries finding everything from the right and append to left 'student_id' is common to both so it has been merged into one and included all the other df_2 columns to df_1 table.<br>

In [25]:
df = pd.merge(df_1, df_2)

## Output

### Display result

In [26]:
df

    student_id student_name student_course student_grade        professors
0            1        Peter        Biology             C     Mark Levinson
1            1        Peter        Biology             C     Mark Levinson
2            1        Peter        Biology             C     Mark Levinson
3            1        Peter        Biology             D  Klaus Michealson
4            1        Peter        Biology             C  Klaus Michealson
..         ...          ...            ...           ...               ...
95          10          Sam        Biology             F  Klaus Michealson
96          10          Sam        Biology             A      Bonnie James
97          10          Sam        Biology             E     Mark Levinson
98          10          Sam        Biology             D     Mark Levinson
99          10          Sam        Biology             C      Bonnie James

[100 rows x 5 columns]

## Other options

### Specifiying the comon column using parameters "on"

In [7]:
df = pd.merge(df_1, df_2, on="student_id")
df

    student_id student_name student_course student_grade        professors
0            1        Peter        Physics             A  Klaus Michealson
1            1        Peter        Physics             E      Bonnie James
2            1        Peter        Physics             C     Mark Levinson
3            1        Peter        Physics             A     Mark Levinson
4            1        Peter        Physics             A  Klaus Michealson
..         ...          ...            ...           ...               ...
95          10          Sam      Chemistry             D      Bonnie James
96          10          Sam      Chemistry             A     Mark Levinson
97          10          Sam      Chemistry             F      Bonnie James
98          10          Sam      Chemistry             C      Angela Marge
99          10          Sam      Chemistry             B  Klaus Michealson

[100 rows x 5 columns]

### Specifying what kind of Joins you want since merging does inner joins by default

- "inner" > Inner Join: INCLUDING ROWS OF FIRST AND SECOND ONLY IF THE VALUE IS THE SAME IN BOTH DATAFRAMES<br />
- "outer" > Outer Join: IT JOINS ALL THE ROWS OF FIRST AND SECOND DATAFRAMES TOGETHER AND CREATE NaN VALUE IF A ROW DOESN'T HAVE A VALUE AFTER JOINING<br />
- "left" > Left Join: INCLUDES ALL THE ROWS IN THE FIRST DATAFRAME AND ADDS THE COLUMNS OF SECOND DATAFRAME BUT IT WON'T INCLUDE THE ROWS OF THE SECOND DATAFRAME IF IT'S NOT THE SAME WITH THE FIRST<br />
- "right" > Right Join: INCLUDES ALL THE ROWS OF SECOND DATAFRAME AND THE COLUMNS OF THE FIRST DATAFRAME BUT WON'T INCLUDE THE ROWS OF THE FIRST DATAFRAME IF IT'S NOT SIMILAR TO THE SECOND DATAFRAME

In [28]:
df = pd.merge(df_1, df_2, on="student_id", how='left')
df

    student_id student_name student_course student_grade        professors
0            1        Peter        Biology             C     Mark Levinson
1            1        Peter        Biology             C     Mark Levinson
2            1        Peter        Biology             C     Mark Levinson
3            1        Peter        Biology             D  Klaus Michealson
4            1        Peter        Biology             C  Klaus Michealson
..         ...          ...            ...           ...               ...
95          10          Sam        Biology             F  Klaus Michealson
96          10          Sam        Biology             A      Bonnie James
97          10          Sam        Biology             E     Mark Levinson
98          10          Sam        Biology             D     Mark Levinson
99          10          Sam        Biology             C      Bonnie James

[100 rows x 5 columns]

### Merging dataframes with same values but different column names
We add two more parameters :<br>
- Left_on means merge using this column name<br>
- Right_on means merge using this column name<br>
i.e merge both id and student_id together<br>
since they don't have same name, they will create different columns on the new table

In [30]:
df_1 = df_1.rename(columns={"student_id": "id"}) # Renamed student_id to id so as to give this example
df_1

   id student_name student_course
0   1        Peter        Biology
1   2        Dolly        Physics
2   3       Maggie        Physics
3   4        David        Physics
4   5     Isabelle        Physics
5   6        Harry        Physics
6   7         Akin      Chemistry
7   8        Abbey        Physics
8   9     Victoria        Biology
9  10          Sam        Biology

In [31]:
df = pd.merge(df_1, df_2, left_on="id", right_on="student_id")
df

    id student_name student_course  student_id student_grade        professors
0    1        Peter        Biology           1             C     Mark Levinson
1    1        Peter        Biology           1             C     Mark Levinson
2    1        Peter        Biology           1             C     Mark Levinson
3    1        Peter        Biology           1             D  Klaus Michealson
4    1        Peter        Biology           1             C  Klaus Michealson
..  ..          ...            ...         ...           ...               ...
95  10          Sam        Biology          10             F  Klaus Michealson
96  10          Sam        Biology          10             A      Bonnie James
97  10          Sam        Biology          10             E     Mark Levinson
98  10          Sam        Biology          10             D     Mark Levinson
99  10          Sam        Biology          10             C      Bonnie James

[100 rows x 6 columns]

### Merging with the index of the first dataframe

In [11]:
df_1.set_index("id") # this will make id the new index for df_1

   student_name student_course
id
1         Peter        Physics
2         Dolly        Biology
3        Maggie      Chemistry
4         David        Biology
5      Isabelle        Biology
6         Harry        Physics
7          Akin      Chemistry
8         Abbey      Chemistry
9      Victoria        Biology
10          Sam      Chemistry

In [12]:
df = pd.merge(df_1, df_2, left_index=True, right_on="student_id")#the new index will be from index of df_2 where they joined
df

    id student_name student_course  student_id student_grade        professors
44   2        Dolly        Biology           1             A  Klaus Michealson
52   2        Dolly        Biology           1             E      Bonnie James
69   2        Dolly        Biology           1             C     Mark Levinson
73   2        Dolly        Biology           1             A     Mark Levinson
94   2        Dolly        Biology           1             A  Klaus Michealson
..  ..          ...            ...         ...           ...               ...
75  10          Sam      Chemistry           9             B     Mark Levinson
82  10          Sam      Chemistry           9             E      Bonnie James
89  10          Sam      Chemistry           9             A      Angela Marge
92  10          Sam      Chemistry           9             B      Angela Marge
99  10          Sam      Chemistry           9             C      Bonnie James

[87 rows x 6 columns]

### Merging both table on their index i.e two indexes

In [13]:
df_2.set_index("student_id") # making student_id the index of Data2

           student_grade        professors
student_id
5                      A      Angela Marge
10                     B      Angela Marge
2                      F     Mark Levinson
6                      D  Klaus Michealson
3                      C      Angela Marge
...                  ...               ...
10                     B  Klaus Michealson
1                      A  Klaus Michealson
1                      D     Mark Levinson
4                      F     Mark Levinson
9                      C      Bonnie James

[100 rows x 2 columns]

In [14]:
df = pd.merge(df_1, df_2, left_index=True, right_index=True) # new index will be from the left index unlike when joining only one index
df

   id student_name student_course  student_id student_grade        professors
0   1        Peter        Physics           5             A      Angela Marge
1   2        Dolly        Biology          10             B      Angela Marge
2   3       Maggie      Chemistry           2             F     Mark Levinson
3   4        David        Biology           6             D  Klaus Michealson
4   5     Isabelle        Biology           3             C      Angela Marge
5   6        Harry        Physics           3             E      Angela Marge
6   7         Akin      Chemistry          10             A  Klaus Michealson
7   8        Abbey      Chemistry           5             A      Bonnie James
8   9     Victoria        Biology           5             B     Mark Levinson
9  10          Sam      Chemistry           6             F      Angela Marge